Tests/StressTest/5000VU_per_S/UseCaseA.yml
config:
  plugins:
  target: "https://kwqnze338k.us-east-1.awsapprunner.com"
  phases:
    - duration: 30
      arrivalRate: 5
      name: Warm up
    - duration: 60
      arrivalRate: 5
      rampTo: 100
      name: 1. Ramp Up
    - duration: 60
      arrivalRate: 100
      rampTo: 1000
      name: 2. Ramp Up
    - duration: 60
      arrivalRate: 1000
      rampTo: 2500
      name: 3. Ramp Up
    - duration: 60
      arrivalRate: 2500
      rampTo: 5000
      name: 4. Ramp Up
    - duration: 120
      arrivalRate: 5000
      name: Hold

scenarios:
  - name: "All recipes"
    flow:
      - get:
          url: "/recipes"
      - think: 2